src/no-python/app/controllers/stimps_controller.rb

SELECT  `stimps`.* FROM `stimps`  ORDER BY `stimps`.`created_at` DESC LIMIT 10
---
  def index
    @stimps = Stimp.all.order(created_at: :desc).limit(10)

SELECT  `stimps`.* FROM `stimps` WHERE `stimps`.`id` = 99 LIMIT 1
---
  def show
    @stimp = Stimp.find(params[:id])

INSERT INTO `stimps` (`course`, `soilType`, `green`, `mower`, `roller`, `forward1`, `backward1`, `left1`, `right1`, `verticut`, `notes`, `entries`, `weather`, `raw_speed`, `adj_speed`, `std_dev`, `created_at`, `updated_at`) VALUES ('Woods', 'Native', '1', 'Eclipse11', 'Smithco1', 120, 120, 120, 120, 0, 'TEST', 1, 'Searching via station...\n[caching result Morey Fld Ap, Middleton, US]\nCurrent conditions at <UNKNOWN>\nLast updated Jun 03, 2017 - 07:35 AM EDT / 2017.06.03 1135 UTC\n   Temperature: 71.1 F (21.7 C)\n   Relative Humidity: 52%\n   Wind: from the SW (220 degrees) at 12 MPH (10 KT)\n   Sky conditions: clear\n', 10.0, 10.0, 0.0, '2017-06-03 11:44:16', '2017-06-03 11:44:16')
---


      # Check whether entry saved to DB or not
      if @stimp.save